/* eslint-disable max-len */
export const OrderC = () => (
  <>
    <div className='container order'>
      <div className='order__content'>
        <div>
          <p className='order__text'>
            Для оформления доставки и оплаты товара перейдите в WhatsApp
          </p>
        </div>
        <a
          className='whatsapp-button'
          href='https://wa.me/79044038112'
          target='_blank'
        >
          <svg
            fill='#fff'
            xmlns='http://www.w3.org/2000/svg'
            width='24'
            height='24'
            viewBox='0 0 24 24'
            // eslint-disable-next-line react/jsx-no-comment-textnodes
          >
            <path d='M.057,22,1.6,16.351a10.9,10.9,0,1,1,4.233,4.133L.057,22ZM6.1,18.51A9.04,9.04,0,1,0,3.59,16.066L2.674,19.41l3.43-.9ZM16.542,13.5c-.068-.114-.249-.182-.522-.318s-1.612-.8-1.862-.886-.431-.137-.613.137-.7.886-.863,1.068-.318.2-.59.068A7.435,7.435,0,0,1,9.9,12.217,8.2,8.2,0,0,1,8.386,10.33c-.159-.272-.017-.42.119-.556s.272-.318.409-.478a1.787,1.787,0,0,0,.275-.454.5.5,0,0,0-.023-.478c-.069-.136-.613-1.477-.84-2.022s-.446-.459-.613-.468l-.523-.009a1,1,0,0,0-.726.341A3.057,3.057,0,0,0,5.511,8.48,5.3,5.3,0,0,0,6.623,11.3a12.145,12.145,0,0,0,4.653,4.113,15.762,15.762,0,0,0,1.553.574,3.744,3.744,0,0,0,1.716.108,2.806,2.806,0,0,0,1.839-1.3,2.269,2.269,0,0,0,.159-1.3Z' />
          </svg>
          <p>
            <strong>WhatsApp</strong>
            <span>Связаться</span>
          </p>
        </a>
      </div>
    </div>
  </>
)
